app/controllers/topics_controller.rb

INSERT INTO "topics" ("name", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "willy"], ["message", "shit"], ["created_at", "2015-04-02 05:16:08.752473"], ["updated_at", "2015-04-02 05:16:08.752473"]]
---
  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save